fotobook/app/views/photos/_photo.html.erb

                    <i class="fa-solid fa-heart fa-xs <%= isLogin ? "like" : "notlike" %> me-1"></i>
                    <span><%= photo.user_like_photo.size %></span>
---
SELECT `photos`.* FROM `photos` WHERE (isPublic = '1')
SELECT `user_like_photo`.* FROM `user_like_photo` WHERE `user_like_photo`.`photo_id` IN (2, 3)
SELECT COUNT(*) FROM `users` INNER JOIN `user_like_photo` ON `users`.`id` = `user_like_photo`.`user_id` WHERE `user_like_photo`.`photo_id` = 2