fotobook/app/views/photos/_photo_post.html.erb

                <% if local_assigns[:follow] %>
                    <%= render partial: "application/follow", locals: { user: photo.user, follow: current_user.followees.include?(photo.user) } %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT 1 AS one FROM `users` INNER JOIN `user1_follow_user2` ON `users`.`id` = `user1_follow_user2`.`user_id` WHERE `user1_follow_user2`.`user_id` = 4 AND `users`.`id` = 3 LIMIT 1

                    <i class="fa-solid fa-heart fa-xs <%= user_signed_in? ? "like" : "notlike" %> me-1"></i>
                    <span><%= photo.user_like_photo.size %></span>
---
SELECT `photos`.* FROM `photos` WHERE (isPublic = '1')
SELECT `user_like_photo`.* FROM `user_like_photo` WHERE `user_like_photo`.`photo_id` IN (2, 3)