fotobook/app/views/users/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = 2 ORDER BY "albums"."created_at" DESC
---
            <% elsif local_assigns[:page] == "albums" %>
                <% @user.albums.each do |album| %>