fotobook/app/controllers/albums_controller.rb

  def search
    input = params[:search]
    if current_user.isAdmin?
      @albums = Album.include_photos.where("title LIKE ? OR description LIKE ?", "%#{input}%", "%#{input}%")
    else
      @albums = Album.include_photos.include_likes.include_users.public_only.where("title LIKE ? OR description LIKE ?", "%#{input}%", "%#{input}%")
---
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = 3 ORDER BY "albums"."created_at" DESC