fotobook/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" ORDER BY "albums"."created_at" DESC
SELECT `photos`.* FROM `photos` INNER JOIN `album_has_photo` ON `photos`.`id` = `album_has_photo`.`photo_id` WHERE `album_has_photo`.`album_id` = 2
SELECT "photos".* FROM "photos" WHERE "photos"."id" IN (4, 5, 6, 7) ORDER BY "photos"."created_at" DESC
---
  def index
    if user_signed_in?
      if current_user.isAdmin?
        @albums = Album.include_photos.page(params[:page]).per(40)
      else
        if request.path.include?("/discover")
          @albums = Album.include_photos.include_likes.include_users.public_only
        else
          @albums = Album.include_photos.include_likes.includes(user: [:followees]).where(user_id: current_user.followees.select(:id), isPublic: true) + Album.include_photos.include_likes.where(user_id: current_user.id)

INSERT INTO "albums" ("title", "description", "user_id", "isPublic", "created_at", "updated_at") VALUES ('test', 'test', 2, TRUE, '2025-07-31 09:47:44.700696', '2025-07-31 09:47:44.700696') RETURNING "id"
INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES (NULL, NULL, 'photo__744fd533.webp', 2, NULL, FALSE, NULL, '2025-07-30 09:15:06.340789', '2025-07-30 09:15:06.340789') RETURNING "id"
INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES (NULL, NULL, 'photo__24052c2e.webp', 2, NULL, FALSE, NULL, '2025-07-31 09:47:44.743894', '2025-07-31 09:47:44.743894') RETURNING "id"
---
  def create
    @album = Album.new(
      title: params[:album][:title],
      description: params[:album][:description],
      isPublic: params[:album][:isPublic] == "1" ? true : false,
      user_id: current_user.id
    )
    if @album.save
      files = params[:album][:images]
      if files
        files.each do |file|
          photo = Photo.new(image: file, isPublic: false, user_id: current_user.id)
          photo.albums << @album
          photo.save

SELECT "photos".* FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 1 AND "photos"."id" = 3 ORDER BY "photos"."created_at" DESC LIMIT 1
SELECT COUNT(*) FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 2
SELECT "albums".* FROM "albums" WHERE "albums"."id" = 1 ORDER BY "albums"."created_at" DESC LIMIT 1
SELECT "photos".* FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 2 AND "photos"."id" = 20 ORDER BY "photos"."created_at" DESC LIMIT 1
DELETE FROM "photos" WHERE "photos"."id" = 13
DELETE FROM "photos" WHERE "photos"."id" = 20
INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES (NULL, NULL, 'photo__619dbb3e.webp', 2, NULL, FALSE, NULL, '2025-07-31 09:58:22.489876', '2025-07-31 09:58:22.489876') RETURNING "id"
INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES (NULL, NULL, 'photo__9d51394f.webp', 2, NULL, FALSE, NULL, '2025-07-31 10:03:04.833764', '2025-07-31 10:03:04.833764') RETURNING "id"
UPDATE "photos" SET "image" = 'image/upload/v1753930987/photo__9d51394f.webp' WHERE "photos"."id" = 19
---
  def update
    new_images = params[:album][:new_images]
    remove_images = params[:album][:remove_images]
    remove_size = remove_images ? remove_images.length : 0
    # raise "Check params"
    if @album.photos.size - remove_size + new_images.length - 1 < 1
      redirect_to edit_user_album_path(current_user.id, @album.id), alert: "Album must have images." and return
    end
    if remove_images.present?
      remove_images.each do |i|
        photo = @album.photos.find(i)
        if photo.title || photo.person_id
          @album.photos.delete(photo)
        else
          photo.destroy!
        end
      end
    end

    if new_images.present?
      new_images.each do |image|
        photo = Photo.new(image: image, isPublic: false, user_id: current_user.id)
        photo.albums << @album
        photo.save

SELECT "photos".* FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 1 ORDER BY "photos"."created_at" DESC
DELETE FROM "photos" WHERE "photos"."id" = 7
DELETE FROM "albums" WHERE "albums"."id" = 1
---
  def destroy
    @album.photos.each do |photo|
      unless photo.title || photo.person_id
        photo.destroy!
      end
    end
    if @album.destroy!

SELECT "albums".* FROM "albums" WHERE "albums"."id" = 2 ORDER BY "albums"."created_at" DESC LIMIT 1
---
    def set_album
      @album = Album.find(params[:id])