fotobook/app/controllers/guest_controller.rb

SELECT `photos`.* FROM `photos` WHERE (isPublic = '1')
SELECT `user_like_photo`.* FROM `user_like_photo` WHERE `user_like_photo`.`photo_id` IN (2, 3)
---
    def photo
        @photos = Photo.includes(:user, :user_like_photo).where('isPublic = ?', true)

SELECT `albums`.* FROM `albums` WHERE (isPublic = '1')
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` IN (4, 5, 6)
SELECT `user_like_album`.* FROM `user_like_album` WHERE `user_like_album`.`album_id` = 2
---
    def album
        @albums = Album.includes(:user, :photos, :user_like_album).where('isPublic = ?', true)