fotobook/app/controllers/photos_controller.rb

  def index
    if user_signed_in?
      if request.path == root_path && params[:page].blank?
        if current_user.isAdmin?
          redirect_to admin_root_path
        else
          redirect_to user_root_path
        end
      end
      if current_user.isAdmin?
        @photos = Photo.photo_only.select(:title, :image, :id, :user_id).page(params[:page]).per(40)
---
SELECT "photos"."title", "photos"."image", "photos"."id", "photos"."user_id" FROM "photos" WHERE "photos"."title" IS NOT NULL ORDER BY "photos"."created_at" DESC LIMIT 40 OFFSET 0

  def search
    input = params[:search]
    @photos = Photo.photo_only.include_likes.include_users.public_only.where("title LIKE ? OR description LIKE ?", "%#{input}%", "%#{input}%")
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = 3 AND "photos"."title" IS NOT NULL ORDER BY "photos"."created_at" DESC

  def create
    file = params[:photo][:image]
    unless file
      render :new, status: :unprocessable_entity, alert: "Photo was not uploaded successfully."
    end

    @photo = Photo.new(
      title: params[:photo][:title],
      description: params[:photo][:description],
      image: file,
      user_id: current_user.id,
      isPublic: params[:photo][:sharing_mode] == "1" ? true : false
    )

    if @photo.save
---
INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES ('test3', 'test3', 'photo__7768a4c5.webp', 2, NULL, FALSE, NULL, '2025-07-30 14:16:34.349215', '2025-07-30 14:16:34.349215') RETURNING "id"

  def update
    file = params[:photo][:image]
    if file
      @photo.remove_image!
      @photo.save
      @photo.image = file
    end

    if @photo.update(
      title: params[:photo][:title],
      description: params[:photo][:description],
      isPublic: params[:photo][:isPublic] == "1" ? true : false
    )
---
UPDATE "photos" SET "image" = 'photo_1_5a1fadbc.webp', "title" = 'Penguin', "description" = 'Silver Penguin', "updated_at" = '2025-07-30 08:46:55.622879' WHERE "photos"."id" = 1
UPDATE "photos" SET "title" = 'test', "isPublic" = TRUE, "updated_at" = '2025-07-30 16:49:22.119458' WHERE "photos"."id" = 9

  def destroy
    if @photo.destroy!
---
DELETE FROM "photos" WHERE "photos"."id" = 9

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = 10 ORDER BY "photos"."created_at" DESC LIMIT 1