fotobook/app/controllers/photos_controller.rb

INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES ('Italian Cat', 'Buon giorno', 'photo__68489bb2.webp', 2, NULL, TRUE, TRUE, '2025-07-30 08:46:10.201812', '2025-07-30 08:46:10.201812') RETURNING "id"
---
  def create
    file = params[:photo][:image]
    unless file
      render :new, status: :unprocessable_entity, alert: "Photo was not uploaded successfully."
    end

    @photo = Photo.new(
      title: params[:photo][:title],
      description: params[:photo][:description],
      image: file,
      user_id: current_user.id,
      isPublic: params[:photo][:sharing_mode] == "1" ? true : false
    )

    if @photo.save

UPDATE "photos" SET "image" = 'image/upload/v1753859797/photo__7768a4c5.webp' WHERE "photos"."id" = 9
---
  def update
    file = params[:photo][:image]
    if file
      @photo.remove_image!
      @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 1 ORDER BY "photos"."created_at" DESC LIMIT 1
---
    def set_photo
      @photo = Photo.find(params[:id])