fotobook/app/controllers/users_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = 2 ORDER BY "albums"."created_at" DESC
---
  def show
    if request.path == photos_path
      render "show", locals: { page: "photos" }
    elsif request.path.include?(t('path.albums'))

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
    def set_user
      if params[:user_id]
        @user = User.find(params[:user_id])
      else
        @user = User.find(params[:id])