fotobook/app/views/application/_like.html.erb

SELECT "user_like_photo".* FROM "user_like_photo" WHERE "user_like_photo"."photo_id" IN (10, 8, 1)
SELECT 1 AS one FROM "photos" INNER JOIN "user_like_photo" ON "photos"."id" = "user_like_photo"."photo_id" WHERE "user_like_photo"."user_id" = 2 AND "photos"."id" = 1 LIMIT 1
---
        <% if local_assigns[:photo] %>
            <% if photo.user_like_photo.include?(current_user) %>

SELECT "user_like_album".* FROM "user_like_album" WHERE "user_like_album"."album_id" = 1
SELECT 1 AS one FROM "albums" INNER JOIN "user_like_album" ON "albums"."id" = "user_like_album"."album_id" WHERE "user_like_album"."user_id" = 2 AND "albums"."id" = 1 LIMIT 1
---
        <% else %>
            <% if album.user_like_album.include?(current_user) %>

SELECT COUNT(*) FROM "users" INNER JOIN "user_like_photo" ON "users"."id" = "user_like_photo"."user_id" WHERE "user_like_photo"."photo_id" = 1
---
    <% end %>
    <span><%= local_assigns[:photo] ? photo.user_like_photo.size : album.user_like_album.size %></span>