fotobook/app/views/application/_profile_header.html.erb

            <div class="border-start mx-lg-3 mx-2"></div>
            <a href=<%= "#{t('path.users')}/#{params[:user_id]}#{t('path.albums')}" %> class="profile-tab" select=<%= page == "albums" ? "true" : "false" %>><span class="fs-3"><%= user.albums.size %></span> ALBUMS</a>
---
SELECT COUNT(*) FROM "albums" WHERE "albums"."user_id" = 2