fotobook/app/views/application/_profile_album.html.erb

SELECT "photos".* FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 1 ORDER BY "photos"."created_at" DESC
---
        <div class="position-relative">
            <% if local_assigns[:album].photos.present? %>

SELECT COUNT(*) FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 2
---
            <div class="rounded-circle fw-bold p-3 photo-counter position-absolute top-50 start-50 translate-middle text-center text-white">
                <div class="m-0 fs-2"><%= local_assigns[:album].photos.size %></div>