fotobook/app/views/albums/_album.html.erb

SELECT `photos`.* FROM `photos` INNER JOIN `album_has_photo` ON `photos`.`id` = `album_has_photo`.`photo_id` WHERE `album_has_photo`.`album_id` = 2
---
        <img class="w-50 h-100 album-image" src=<%= album.photos[0].url %> data-bs-toggle="modal" data-bs-target="#album-content"
        data-title="<%= album.title %>" data-description="<%= album.description %>" data-photos="<%= album.photos.map(&:url).join(';') %>">

SELECT `albums`.* FROM `albums` WHERE (isPublic = '1')
SELECT `user_like_album`.* FROM `user_like_album` WHERE `user_like_album`.`album_id` = 2
SELECT COUNT(*) FROM `users` INNER JOIN `user_like_album` ON `users`.`id` = `user_like_album`.`user_id` WHERE `user_like_album`.`album_id` = 1
---
                    <i class="fa-solid fa-heart fa-xs like me-1"></i>
                    <span><%= album.user_like_album.size %></span>