fotobook/app/views/albums/edit.html.erb

SELECT "photos".* FROM "photos" INNER JOIN "album_has_photo" ON "photos"."id" = "album_has_photo"."photo_id" WHERE "album_has_photo"."album_id" = 1 ORDER BY "photos"."created_at" DESC
---
            <div class="container album-images d-flex flex-wrap mb-5">
                <% @album.photos.each do |photo| %>