fotobook/app/controllers/users/registrations_controller.rb

INSERT INTO "photos" ("title", "description", "image", "user_id", "person_id", "isPublic", "image_processing", "created_at", "updated_at") VALUES (NULL, NULL, 'photo__c401f890.webp', 2, 2, FALSE, NULL, '2025-07-30 14:29:06.839145', '2025-07-30 14:29:06.839145') RETURNING "id"
---
  def update
    self.resource = User.to_adapter.get!(send(:"current_#{resource_name}").to_key)

    if params[:user][:password].present? && params[:user][:password_confirmation].present? && params[:user][:current_password].present?
      if resource.update_with_password(user_params)
        bypass_sign_in resource
        redirect_to after_update_path_for(resource), notice: 'Password updated successfully.'
      else
        render :edit, status: :unprocessable_entity
      end
    elsif params[:user][:fname].present? || params[:user][:lname].present? || params[:user][:email].present?
      if params[:user][:avatar]
        file = params[:user][:avatar]
        if file
          result = Cloudinary::Uploader.upload(file.path, folder: "#{current_user.id}/photos", transformation: [{ width: 200, crop: :fill }])
          url = result['secure_url']
        end

        @photo = Photo.new(
          url: url,
          user_id: current_user.id,
          person_id: current_user.id,
          isPublic: false
        )

        unless @photo.save